// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Овој софтвер треба да биде инсталиран за да продолжите понатака.";
"ERROR_INSTALL" = "Овој дел не одговара на барањата за надоградба.";

"Newer_Package_Installed_message" = "Понова верзија на Chameleon е веќе инсталирана.";
"Intel_Mac_message" = "Софтверот не може да биде инсталиран на овој компјутер.";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Тип на инсталација";
"InstallType_description" = "Одберете да извршите нова инсталација или да ја надоградите постоечката инсталација.";

"New_title" = "Нова инсталација";
"New_description" = "Зачувување на постоечката папка /Extra, ако е пронајдена на одредената партиција. Ќе биде креирана нова ако е одбрана некоја опција, различна од Bootloader.";

"Upgrade_title" = "Надоградба";
"Upgrade_description" = "Додавање во постоечката папка /Extra, ако е пронајдена на одредената партиција. Ќе биде креирана нова ако е одбрана некоја опција, различна од Bootloader.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Chameleon-от има потреба од три основни датотеки. (едноставно)
boot0 (Во MBR на драјвот) одговорен за вчитување на boot1.
boot1 (Во boot-секторот на партицијата) за пронаоѓање на boot2.
boot2 (Во root папката на партицијата) за вчитување на kernel-от итн.";

"Standard_title" = "Chameleon Стандард";
"Standard_description" = "Стандардна инсталација на Chameleon";

"EFI_title" = "EFI";
"EFI_description" = "Инсталација на Chameleon/овите датотеки во обично скриената EFI партиција користејќи boot0 или boot0md во зависност од вашиот систем и без уништување на било која постоечка Windows инсталација што ја имате.";

"noboot_title" = "Ништо";
"noboot_description" = "Не инсталирај Chameleon (корисно за инсталација само на Extra компоненти)";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Moдули";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file.";

"klibc_title" = "klibc";
"klibc_description" = "Овој модул обезбедува стандардна 'c' библиотека за да се поврзат модулите ако библиотекаta обезбеденa од страна на chameleon е недоволна.
Ова е во моментов само се користи од страна на uClibc++ библиотеката.
Извор: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Резолуција";
"AutoReso_description" = "Овој модул ja чита 'edid' информацијата од мониторот додадена на главниот екран.
Модулот во моментов не е интегриран во 'trunk' и има минимална употреба.
Покрај тоа, модулот ќе ги преработипеч на VESA модовите достапни пред Intel HD графичките картички да обезбеди соодветна резолуција, при подигнување.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Овој модул обезбедува минимална C++ библиотека за употреба во други модули.
Ова не обезбедува функционалност само по себе, наместо тоа се користи за да овозможи C++ јазикот да се користи во други модули.
Ве молиме имајте во предвид дека RTTI и исклучоци се оневозможени.
Извор: http://cxx.uclibc.org/
Зависности: klibc ";

"Keylayout_title" = "Распоред на тастатура";
"Keylayout_description" = "Овој модул овозможува на корисникот да дефинира мапирање на тастатурата.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Алатки";
"Utility_description" = "Опционални алатки";

"PrefPanel_title" = "Preference Panel";
"PrefPanel_description" = "Инсталира Preference Panel за Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Копира пример на smbios.plist во /Extra/Configuration.";

"Documentation_title" = "Документација";
"Documentation_description" = "Документација за Chameleon упатство за инсталација и користење";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Опции";
"Options_description" = "Подразбирани опции";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Не го прикажува Chameleon's boot лого во графичкиот интерфејс.";

"GUI_title" = "GUI";
"GUI_description" = "Исклучува графички интерфејс со додавање на GUI=n во org.chameleon.Boot.plist";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Користете го оригиналното (сиво на бело) apple лого наместо boot.png во темата.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Приказ на екранот за избор на партиција.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Вклучува тивок boot мод (без пораки и прашања).";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Вклучува приказ на детали за партициите и резолуцијата.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Прави пауза на boot процесот на Chameleon и чека на притистање на некој тастер пред на стартува mach kernel. Корисно во комбинација со verbose boot за отклонување на проблеми.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Користење на 32 битниот мод наместо подразбираниот 64 битен.";

"EHCIacquire_title" = "EHCIacquire";
"EHCIacquire_description" = "Додава EHCIacquire=y во org.chameleon.Boot.plist. Оваа опција поправа секакви EHCI (USB 1.0) проблеми поради некоректно напишани BIOS-и.";

"EthernetBuiltIn_title" = "EthernetBuiltIn";
"EthernetBuiltIn_description" = "Додава EthernetBuiltIn=y во org.chameleon.Boot.plist. Оваа опција ќе ги направи 'вградени' вашите мрежни картички.";

"ForceHPET_title" = "ForceHPET";
"ForceHPET_description" = "Добива ForceHPET=y во org.chameleon.Boot.plist. Вклучува HPET при Intel чипсети за BIOS-и, кој не располагаат со HPET.";

"ForceWake_title" = "ForceWake";
"ForceWake_description" = "Додава ForceWake=y во org.chameleon.Boot.plist. Опцијата дозволува да прескокнете некоректни исклучувања на оперативниот систем.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Ја исклучува автоматски вклучената корекција за рестарт.";

"UHCIreset_title" = "UHCIreset";
"UHCIreset_description" = "Додава UHCIreset=y во org.chameleon.Boot.plist. Инициализација UHCI (USB 2.0) контролерите пред стартување на OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Исклучува автоматско препознавање на RAM меморијата.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Само за Lion. Вклучува учитување на pre-linked kernel-от. Ова ке ги игнорира /E/E и /S/L/E. Користете го ова само ако сте сигурни дека имате се што ви е потребно.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Пробува да вчита sleep image креиран при последната хибернација.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Нов метод на генерирање на C-State користејќи ги SystemIO регистрите наместо FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Ги отфрла вградените SSDT табели од матичната плоча.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Вклучува специфичена состојба на напојување на процесорот, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Вклучува специфичена состојба на напојување на процесорот, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Вклучува специфичена состојба на напојување на процесорот, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Вклучува автоматско генерирање на C-States за процесорот.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Вклучува автоматско генерирање на P-States за процесорот.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Го поставува графичкиот режим на 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Го поставува графичкиот режим на 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Го поставува графичкиот режим на 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Го поставува графичкиот режим на 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Го поставува графичкиот режим на 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Го поставува графичкиот режим на 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Го поставува графичкиот режим на 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Го поставува графичкиот режим на 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Го поставува графичкиот режим на 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Го поставува графичкиот режим на 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Го поставува графичкиот режим на 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler";
"GraphicsEnabler_description" = "Додава GraphicsEnabler=y во org.chameleon.Boot.plist. Автоматско препознавање на графички карти со nVidia чипсети.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Вклучува UseAtiROM опции.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Вклучува UseNvidiaROM опции.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Вклучува VBIOS oпција";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Го вклучува опширното логирање и ви овозможува да ги видите пораките од Chameleon и OS X kernel-от при вчитување. Ова е од суштинско значење за решавање на проблеми.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "Опција за вчитување на OS X во BSD/Unix командна линија.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Не е опција што е потребна за секојдневна подигнување, но тоа може да биде корисно ако сакате OS X да ги вчита сите датотеки од системските папки, наместо да се потпира на вградените кеш датотеки.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "За надминување на закочувањето на 'PCI configuration begin' на некои системи. 0x2000 е kIOPCIConfiguratorPFM64 ознака, како што се гледа во изворниот код на IOPCIFamily.";

"Npci3_title" = "npci=0x3000";
"Npci3_description" = "За надминување на закочувањето на 'PCI configuration begin' на некои системи. 0x3000 е kIOPCIConfiguratorPFM64 ознака, како што се гледа во изворниот код на IOPCIFamily.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Само за Lion. Ја исклучува можноста 'low power wake' која што понекогаш остава црн екран после будењето од заспивање.";


// ----------------------------------------------------------------------------
// Boot options - KEYMAPS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Користете распоред на тастатура за Германска Mac тастатура";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Користете распоред на тастатура за Шпанска Mac тастатура";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Користете распоред на тастатура за Француска Mac тастатура";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Користете распоред на тастатура за Италијанска Mac тастатура";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Користете распоред на тастатура за Шведска Mac тастатура";

"mac-pt_title" = "Portuguese Mac Keyboard";
"mac-pt_description" = "Користете распоред на тастатура за Португалија Mac тастатура";

"pc-de_title" = "German PC Keyboard";
"pc-de_description" = "Користете распоред на тастатура за Германска PC тастатура";

"pc-es_title" = "Spanish PC Keyboard";
"pc-es_description" = "Користете распоред на тастатура за Шпанска PC тастатура";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Користете распоред на тастатура за Француска PC тастатура";

"pc-it_title" = "Italian PC Keyboard";
"pc-it_description" = "Користете распоред на тастатура за Италијанска PC тастатура";

"pc-se_title" = "Swedish PC Keyboard";
"pc-se_description" = "Користете распоред на тастатура за Шведска PC тастатура";

"pc-pt_title" = "Portuguese PC Keyboard";
"pc-pt_description" = "Користете распоред на тастатура за Португалија PC тастатура";

// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Мала едноставна верзија од новата примарна тема што се користи при креирање на верзија од Chameleon што бара вградена тема. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Претходната вградена тена на Chameleon";

"Default_title" = "Стандардна";
"Default_description" = "Вградената тема во Chameleon.";

"Bullet_title" = "Bullet";
"Bullet_description" = "The Bullet тема од NoSmokingBandit";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Опции за контрола";
"Control_description" = "Подесувања за контрола на работата на Chameleon.";

// General
"General_title" = "Основни опции";
"General_description" = "Избор од секцијата на основни опции.";

// KernelFlags
"KernelFlags_title" = "Kernel Ознаки";
"KernelFlags_description" = "Избор од секцијата на ознаките на kernel-от.";

// PowerManagement
"PowerManagement_title" = "Менаџменат на напојување";
"PowerManagement_description" = "Избор од секцијата на менаџирање на напојувањето.";

// Resolution
"Resolution_title" = "Резолуција";
"Resolution_description" = "Set one resolution to use.";

// Video
"Video_title" = "Видео";
"Video_description" = "Опции кои се однесуваат за графиката.";

// Keymaps
"Keymaps_title" = "Распоред на тастатура";
"Keymaps_description" = "Select one keylayout to use. This will also install the Keylayout module and keymaps.";

// Themes
"Themes_title" = "Теми";
"Themes_description" = "Колекција од теми
Повеќе теми може да се најдат на http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "Ништо";
"ChooseNone-Resolution_description" = "Не избирајте резолуција.";

"ChooseNone-keylayout_title" = "Ништо";
"ChooseNone-keylayout_description" = "Не избирајте распоред на тастатура.";
